# ViewScalePulldownImperial Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewScalePulldownImperial Property
ParameterTypeId Class See Also
---
"View Scale"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewScalePulldownImperial { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewScalePulldownImperial As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewScalePulldownImperial {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace